---
kind: other
id: Properties.T:Autodesk.Revit.DB.ImageInstance
source: html/a5861972-2552-ad43-559a-d2163e936942.htm
---
# ImageInstance Properties

The id of the assembly instance to which the element belongs.